In [254]:
import pandas as pd
import random_address
import numpy as np

In [255]:
name_male = pd.read_csv("D:\jupyter_notebook\SIH\Indian-Male-Names.csv")

In [256]:
name_male.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [257]:
name_female =  pd.read_csv("D:\jupyter_notebook\SIH\Indian-Female-Names.csv")

In [258]:
name_female

                            name gender    race
0                        shivani      f  indian
1                           isha      f  indian
2                smt shyani devi      f  indian
3                          divya      f  indian
4                          mansi      f  indian
...                          ...    ...     ...
15377                 saroj devi      f  indian
15378              naina @ geeta      f  indian
15379  manju d/0 baboo lal jatav      f  indian
15380                    shivani      f  indian
15381                      nayna      f  indian

[15382 rows x 3 columns]

In [259]:
nm = name_male[:300]

In [260]:
nf = name_female[:300]

In [261]:
name = pd.concat([nm,nf])

In [262]:
type(name)

pandas.core.frame.DataFrame

In [263]:
type(nf)

pandas.core.frame.DataFrame

In [264]:
name = np.array(name)

In [265]:
name = pd.DataFrame(name,columns=["name","gender","race"])

In [266]:
type(name)

pandas.core.frame.DataFrame

In [267]:
name = name.sample(frac = 1)

In [268]:
name.head()

                name gender    race
544      asha kumari      f  indian
127            nitin      m  indian
583           tripti      f  indian
155         som dutt      m  indian
121  bhagwati prasad      m  indian

In [269]:
add = random_address.real_random_address_by_state("CA")

In [270]:
add

{'address1': '2086 Hillside Drive',
 'address2': '',
 'city': 'San Leandro',
 'state': 'CA',
 'postalCode': '94577',
 'coordinates': {'lat': 37.7238372, 'lng': -122.1334006}}

In [271]:
#add 
#addhar no
#dob
 #your #name, address?, #gender, #date of birth?,#age?, ten finger prints?, facial photograph?, #mobile number (optional)? and #email ID (optional)?,#addhar_no?.

In [272]:
import random

In [273]:
phno = []

In [274]:
for i in range(600):
    phno.append(random.randint(1000000000,9999999999))

In [275]:
phone_no = np.array(phno)

In [276]:
phone_no = pd.DataFrame(phone_no,columns=["phone_name"])

In [277]:
dob = []

In [278]:
import pandas as pd
import numpy as np
from datetime import date, timedelta
from random import choices
test_date1, test_date2 = date(1922, 1,1 ), date(2022, 1, 1)
K = 600
res_dates = [test_date1]
while test_date1 != test_date2:
    test_date1 += timedelta(days=1)
    res_dates.append(test_date1)
res = choices(res_dates, k=K)
dob.append(res)

In [279]:
phone_no.head()

   phone_name
0  7041777811
1  7649264094
2  3391682466
3  8305024990
4  6372700974

In [280]:
from datetime import datetime

In [281]:
dob_year = []
dob_month = []
dob_day = []
dob_yr = []

In [282]:
for i in range(600):

    year = dob[0][i].strftime("%Y")
    month = dob[0][i].strftime("%m")
    day = dob[0][i].strftime("%d")
    dob_yr.append(year)
    dob_month.append(month)
    dob_day.append(day)

In [283]:
dob_year = np.array(dob_yr)
dob_month = np.array(dob_month)
dob_day = np.array(dob_day)

In [284]:
dob_year = pd.DataFrame(dob_year,columns=["dob_year"])
dob_month = pd.DataFrame(dob_month,columns=["dob_year"])
dob_day = pd.DataFrame(dob_day,columns=["dob_year"])

In [285]:
dob_year.head()

  dob_year
0     1944
1     1985
2     1946
3     1993
4     1955

In [286]:
age =[]
for i in dob_yr:
    age.append(int((date.today().year-int(i))))

In [287]:
type(age[10])

int

In [288]:
age = np.array(age)
age = pd.DataFrame(age,columns=["age"])

In [289]:
age.head()

   age
0   78
1   37
2   76
3   29
4   67

In [290]:
addhar_no = []
for i in range(600):
    addhar_no.append(random.randint(100000000000,999999999999))
addhar_no = np.array(addhar_no)
addhar_no = pd.DataFrame(addhar_no,columns=["addhar_no"])

In [291]:
addhar_no.head()

      addhar_no
0  971661941956
1  556730133501
2  525505683683
3  235681252902
4  925621932215

In [305]:
n = np.array(name["name"])

In [310]:
type(n[1])

str

In [328]:
index = []
counter = 0
for i in n:
    k = i
    for j in k:
        if(ord(j) >=65 and ord(j)<=122):
            index.append(counter)
    counter +=1

TypeError: 'float' object is not iterable

In [293]:
name["name"][3]

'birender mandal'

In [324]:
k = name["name"][3]
counter = 0

for j in n:
        for i in j:
            print(i)
        counter += 1

TypeError: 'float' object is not iterable

In [326]:
ord("a")

97

In [ ]:
age
name
phone_no
dob_year 
dob_month 
dob_day 
addhar_no

In [330]:
name.to_csv("name_600.csv",index= False)

In [333]:
name = pd.read_csv("D:\jupyter_notebook\SIH\name_600.csv")

OSError: [Errno 22] Invalid argument: 'D:\\jupyter_notebook\\SIH\name_600.csv'

In [337]:
name_new = pd.read_csv("name_600.csv")

In [338]:
name_new.head()

              name gender    race
0      asha kumari      f  indian
1            nitin      m  indian
2           tripti      f  indian
3         som dutt      m  indian
4  bhagwati prasad      m  indian

In [339]:
email = pd.read_csv("email.csv")

In [340]:
email.head()

       ashakumari@gmail.com
0           nitin@gmail.com
1          tripti@gmail.com
2         somdutt@gmail.com
3  bhagwatiprasad@gmail.com
4         yognder@gmail.com

In [341]:
age
name_new
phone_no
dob_year 
dob_month 
dob_day 
addhar_no
email

         ashakumari@gmail.com
0             nitin@gmail.com
1            tripti@gmail.com
2           somdutt@gmail.com
3    bhagwatiprasad@gmail.com
4           yognder@gmail.com
..                        ...
594           vikas@gmail.com
595           midda@gmail.com
596            tina@gmail.com
597           vipin@gmail.com
598            azaz@gmail.com

[599 rows x 1 columns]